Reports/бит_ПоквартирнаяКарточка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_ПоквартирнаяКарточка</Name>
			<Comment>bit_semenov_ЛТ90</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>мПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПроживающих</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ФИОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ФИОПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипыКонтактнойИнформации</Name>
			<Comment>БИТ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/бит_ПоквартирнаяКарточка/Ext/ObjectModule.bsl
Перем ВтораяСтраница;
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыИФункции

// Процедура формирует отчет.
// 
// Параметры: 
// 		ТабДок - ЭлементыФормы - Результат отчета.
//
Процедура ПоквартирнаяКарточкаВывести(ТабДок, ЛицевыеСчета, ВариантОтчета) Экспорт 
	
	ВтораяСтраница = Ложь;
	
	ТабДок.Очистить();
	// БИТ_ЖКХ изменения кода: 07.02.2012
	// Добавление в запрос настроек (упорядочивание),. 
	// Для вывода последнего ответственного по ЛС.
	
	Запрос =  Новый Запрос;
	
	//+bit_semenov.v_13.04.22
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК Ссылка,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_ЛицевыеСчета.Здание КАК Здание,
	|	бит_ЛицевыеСчета.Квартира.НомерКвартиры КАК НомерКвартиры,
	|	бит_ЛицевыеСчета.Квартира.ПрефиксКвартиры КАК ПрефиксКвартиры,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК УлицаЛицевогоСчета,
	|	бит_ЛицевыеСчета.Здание.Корпус КАК ЗданиеКорпус,
	|	бит_ЛицевыеСчета.Здание.ПочтовыйАдрес КАК ЗданиеПочтовыйАдрес,
	|	бит_ЛицевыеСчета.Квартира.Представление КАК КвартираПредставление,
	|	бит_ЛицевыеСчета.Здание.НомерДома КАК ЗданиеНомерДома
	|ПОМЕСТИТЬ ВТ_ЛС
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка = &ПервыйЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Квартира,
	|	Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК Ссылка,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_ЛицевыеСчета.Здание КАК Здание,
	|	бит_ЛицевыеСчета.Квартира.НомерКвартиры КАК НомерКвартиры,
	|	бит_ЛицевыеСчета.Квартира.ПрефиксКвартиры КАК ПрефиксКвартиры,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК УлицаЛицевогоСчета,
	|	бит_ЛицевыеСчета.Здание.Корпус КАК ЗданиеКорпус,
	|	бит_ЛицевыеСчета.Здание.ПочтовыйАдрес КАК ЗданиеПочтовыйАдрес,
	|	бит_ЛицевыеСчета.Квартира.Представление КАК КвартираПредставление,
	|	бит_ЛицевыеСчета.Здание.НомерДома КАК ЗданиеНомерДома
	|ПОМЕСТИТЬ ВТ_ВсеКвартиры
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка В(&ЛицевыеСчета)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Квартира,
	|	Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СУММА(ЕСТЬNULL(бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь, 0)) КАК ЖилаяПлощадь
	|ПОМЕСТИТЬ ВТ_Площадь
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	|			&МоментВремени,
	|			Квартира В
	|				(ВЫБРАТЬ
	|					ВТ_ВсеКвартиры.Квартира
	|				ИЗ
	|					ВТ_ВсеКвартиры)) КАК бит_СведенияОКвартиреСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира КАК Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК ПредставлениеКвартиры
	|ПОМЕСТИТЬ ВТ_ПредставлениеКвартиры
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	|			&МоментВремени,
	|			Квартира В
	|				(ВЫБРАТЬ
	|					вт_ЛС.Квартира
	|				ИЗ
	|					вт_ЛС)) КАК бит_СведенияОКвартиреСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ВладелецЛС,
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	ФИОФизическихЛицСрезПоследних.Фамилия + "" "" + ФИОФизическихЛицСрезПоследних.Имя + "" "" + ФИОФизическихЛицСрезПоследних.Отчество КАК ФизЛицо
	|ПОМЕСТИТЬ ВТ_ОтветЛица
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&МоментВремени,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ВТ_ЛС.Ссылка
	|				ИЗ
	|					ВТ_ЛС)) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&МоментВремени, ) КАК ФИОФизическихЛицСрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЛицевойСчет,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПроживающиеПоЛС.ФизЛицо КАК ФизЛицо,
	|	ПроживающиеПоЛС.ФизЛицо.ДатаРождения КАК ДатаРОждения,
	|	ПроживающиеПоЛС.СтатусФизЛица КАК СтатусФизЛица,
	|	ПроживающиеПоЛС.СтепеньРодства КАК РодственнаяСвязь,
	|	ПроживающиеПоЛС.СтатусПроживания КАК СтатусПроживания,
	|	ПроживающиеПоЛС.ДатаРегистрации КАК ДатаРегистрации,
	|	ПроживающиеПоЛС.ДатаСнятияСРегистрации КАК ДатаСнятияРУ,
	|	ПроживающиеПоЛС.ДоляПлощади КАК ДоляПлощади,
	|	ПроживающиеПоЛС.лб_ДоляПлощадиСтрокой КАК ДоляПлощадиСтрокой,
	|	ПроживающиеПоЛС.бит_ПомещенВАрхив КАК бит_ПомещенВАрхив,
	|	ВЫБОР
	|		КОГДА ПроживающиеПоЛС.лб_ДоляПлощадиСтрокой <> """"
	|				ИЛИ ПроживающиеПоЛС.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|					И ПроживающиеПоЛС.лб_ДоляПлощадиСтрокой = """"
	|			ТОГДА 0
	|		КОГДА ПроживающиеПоЛС.лб_ДоляПлощадиСтрокой = """"
	|				И НЕ ПроживающиеПоЛС.СтепеньРодства В (&мЗначенияБывшСобственники)
	|			ТОГДА 1
	|		КОГДА ПроживающиеПоЛС.СтепеньРодства В (&мЗначенияБывшСобственники)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Приоритет,
	|	ВЫБОР
	|		КОГДА ПроживающиеПоЛС.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоОтвественный
	|ПОМЕСТИТЬ ВТ_Проживающие
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&МоментВремени,
	|			ЛицевойСчет В (&ЛицевыеСчета)
	|				И НЕ лб_ИгнорироватьПериодВКопииФЛС) КАК ПроживающиеПоЛС
	|ГДЕ
	|	(НЕ ПроживающиеПоЛС.бит_ПомещенВАрхив
	|			ИЛИ ПроживающиеПоЛС.бит_ПомещенВАрхив
	|				И ПроживающиеПоЛС.бит_ВПечать)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_ПроживающиеПоЛС.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛС.ФизЛицо.ДатаРождения КАК ДатаРОждения,
	|	бит_ПроживающиеПоЛС.СтатусФизЛица КАК СтатусФизЛица,
	|	бит_ПроживающиеПоЛС.СтепеньРодства КАК РодственнаяСвязь,
	|	бит_ПроживающиеПоЛС.СтатусПроживания КАК СтатусПроживания,
	|	бит_ПроживающиеПоЛС.ДатаРегистрации КАК ДатаРегистрации,
	|	бит_ПроживающиеПоЛС.ДатаСнятияСРегистрации КАК ДатаСнятияРУ,
	|	бит_ПроживающиеПоЛС.ДоляПлощади КАК ДоляПлощади,
	|	бит_ПроживающиеПоЛС.лб_ДоляПлощадиСтрокой КАК ДоляПлощадиСтрокой,
	|	бит_ПроживающиеПоЛС.бит_ПомещенВАрхив КАК бит_ПомещенВАрхив,
	|	2 КАК Приоритет,
	|	ЛОЖЬ КАК ЭтоОтвественный
	|ПОМЕСТИТЬ ВТ_ПрежниеПроживающие
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС КАК бит_ПроживающиеПоЛС
	|ГДЕ
	|	бит_ПроживающиеПоЛС.бит_ПомещенВАрхив
	|	И бит_ПроживающиеПоЛС.бит_ВПечать
	|	И бит_ПроживающиеПоЛС.ФизЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Проживающие.ФизЛицо КАК ФизЛицо
	|			ИЗ
	|				ВТ_Проживающие КАК ВТ_Проживающие
	|			ГДЕ
	|				НЕ ВТ_Проживающие.бит_ПомещенВАрхив)
	|	И бит_ПроживающиеПоЛС.ЛицевойСчет В(&ЛицевыеСчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Проживающие.ФизЛицо КАК ФизЛицо,
	|	ВТ_Проживающие.ДатаРОждения КАК ДатаРОждения,
	|	ВТ_Проживающие.СтатусФизЛица КАК СтатусФизЛица,
	|	ВТ_Проживающие.РодственнаяСвязь КАК РодственнаяСвязь,
	|	ВТ_Проживающие.СтатусПроживания КАК СтатусПроживания,
	|	ВТ_Проживающие.ДатаРегистрации КАК ДатаРегистрации,
	|	ВТ_Проживающие.ДатаСнятияРУ КАК ДатаСнятияРУ,
	|	ВТ_Проживающие.ДоляПлощади КАК ДоляПлощади,
	|	ВТ_Проживающие.ДоляПлощадиСтрокой КАК ДоляПлощадиСтрокой,
	|	ВТ_Проживающие.бит_ПомещенВАрхив КАК бит_ПомещенВАрхив,
	|	ВТ_Проживающие.Приоритет КАК Приоритет,
	|	ВТ_Проживающие.ЭтоОтвественный КАК ЭтоОтвественный
	|ПОМЕСТИТЬ ВТ_ВсеПроживающие
	|ИЗ
	|	ВТ_Проживающие КАК ВТ_Проживающие
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПрежниеПроживающие.ФизЛицо,
	|	ВТ_ПрежниеПроживающие.ДатаРОждения,
	|	ВТ_ПрежниеПроживающие.СтатусФизЛица,
	|	ВТ_ПрежниеПроживающие.РодственнаяСвязь,
	|	ВТ_ПрежниеПроживающие.СтатусПроживания,
	|	ВТ_ПрежниеПроживающие.ДатаРегистрации,
	|	ВТ_ПрежниеПроживающие.ДатаСнятияРУ,
	|	ВТ_ПрежниеПроживающие.ДоляПлощади,
	|	ВТ_ПрежниеПроживающие.ДоляПлощадиСтрокой,
	|	ВТ_ПрежниеПроживающие.бит_ПомещенВАрхив,
	|	ВТ_ПрежниеПроживающие.Приоритет,
	|	ВТ_ПрежниеПроживающие.ЭтоОтвественный
	|ИЗ
	|	ВТ_ПрежниеПроживающие КАК ВТ_ПрежниеПроживающие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЛС.Ссылка КАК Ссылка,
	|	ВТ_ЛС.Квартира КАК Квартира,
	|	ВТ_ЛС.Здание КАК Дом,
	|	ВТ_ЛС.НомерКвартиры КАК НомерКвартиры,
	|	ВТ_ЛС.УлицаЛицевогоСчета КАК УлицаРег,
	|	ВТ_ЛС.ЗданиеНомерДома КАК ДомРег,
	|	ВТ_ЛС.ЗданиеКорпус КАК КорпусРег,
	|	ВТ_ПредставлениеКвартиры.ПредставлениеКвартиры КАК КвартираРег,
	|	ВТ_ЛС.ЗданиеПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ВТ_ОтветЛица.ВладелецЛС КАК ВладелецЛС,
	|	ВТ_ОтветЛица.ФизЛицо КАК ФизЛицо,
	|	ВТ_Площадь.ЖилаяПлощадь КАК ЖилПлощадь
	|ИЗ
	|	ВТ_ЛС КАК ВТ_ЛС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Площадь КАК ВТ_Площадь
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтветЛица КАК ВТ_ОтветЛица
	|		ПО (ВТ_ОтветЛица.ЛицевойСчет = ВТ_ЛС.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредставлениеКвартиры КАК ВТ_ПредставлениеКвартиры
	|		ПО ВТ_ЛС.Квартира = ВТ_ПредставлениеКвартиры.Квартира
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ПравоустанавливающиеДокументы.ВидДокумента КАК ВидДокумента,
	|	ЕСТЬNULL(бит_ПравоустанавливающиеДокументы.НомерДокумента, """""""") КАК НомерДокумента,
	|	ЕСТЬNULL(бит_ПравоустанавливающиеДокументы.ДатаДокумента, """""""") КАК ДатаДокумента,
	|	ЕСТЬNULL(бит_ПравоустанавливающиеДокументы.ОрганизацияВыдавшаяДокумент, """""""") КАК ОрганизацияВыдавшаяДокумент
	|ИЗ
	|	Справочник.бит_ПравоустанавливающиеДокументы КАК бит_ПравоустанавливающиеДокументы
	|ГДЕ
	|	бит_ПравоустанавливающиеДокументы.бит_ЛицевойСчет В(&ЛицевыеСчета)
	|	И НЕ бит_ПравоустанавливающиеДокументы.бит_Архивный
	|	И НЕ бит_ПравоустанавливающиеДокументы.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПравоустанавливающиеДокументы.ВидДокумента,
	|	ЕСТЬNULL(бит_ПравоустанавливающиеДокументы.НомерДокумента, """"""""),
	|	ЕСТЬNULL(бит_ПравоустанавливающиеДокументы.ДатаДокумента, """"""""),
	|	ЕСТЬNULL(бит_ПравоустанавливающиеДокументы.ОрганизацияВыдавшаяДокумент, """""""")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВсеПроживающие.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА ФИОФизЛиц.Фамилия ЕСТЬ NULL
	|			ТОГДА ВТ_ВсеПроживающие.ФизЛицо
	|		ИНАЧЕ ФИОФизЛиц.Фамилия + "" "" + ФИОФизЛиц.Имя + "" "" + ФИОФизЛиц.Отчество
	|	КОНЕЦ КАК ФИО,
	|	ВТ_ВсеПроживающие.ДатаРОждения КАК ДатаРОждения,
	|	ВТ_ВсеПроживающие.СтатусФизЛица КАК СтатусФизЛица,
	|	ВТ_ВсеПроживающие.РодственнаяСвязь КАК РодственнаяСвязь,
	|	ВТ_ВсеПроживающие.СтатусПроживания КАК СтатусПроживания,
	|	ВТ_ВсеПроживающие.ДатаРегистрации КАК ДатаРегистрации,
	|	ВТ_ВсеПроживающие.ДатаСнятияРУ КАК ДатаСнятияРУ,
	|	ВТ_ВсеПроживающие.ДоляПлощади КАК ДоляПлощади,
	|	ВТ_ВсеПроживающие.ДоляПлощадиСтрокой КАК ДоляПлощадиСтрокой,
	|	ВТ_ВсеПроживающие.бит_ПомещенВАрхив КАК бит_ПомещенВАрхив,
	|	ВТ_ВсеПроживающие.Приоритет КАК Приоритет,
	|	ВТ_ВсеПроживающие.ЭтоОтвественный КАК ЭтоОтвественный
	|ИЗ
	|	ВТ_ВсеПроживающие КАК ВТ_ВсеПроживающие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(
	|				&МоментВремени,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Проживающие.ФизЛицо
	|					ИЗ
	|						ВТ_Проживающие)) КАК ФИОФизЛиц
	|		ПО ВТ_ВсеПроживающие.ФизЛицо = ФИОФизЛиц.ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоОтвественный УБЫВ,
	|	Приоритет,
	|	ДатаРегистрации";

	мЗначенияБывшСобственники = Новый Массив;
	мЗначенияБывшСобственники.Добавить(Справочники.бит_СтепениРодстваФизЛиц.НайтиПоКоду("121")); //преж жилец
	мЗначенияБывшСобственники.Добавить(Справочники.бит_СтепениРодстваФизЛиц.НайтиПоКоду("118")); //быв. соб-к
	мЗначенияБывшСобственники.Добавить(Справочники.бит_СтепениРодстваФизЛиц.НайтиПоКоду("003")); //б/соб.
	
	Запрос.УстановитьПараметр("ПервыйЛицевойСчет"   , ЛицевыеСчета[0].Значение);
	Запрос.УстановитьПараметр("ЛицевыеСчета"    	, ЛицевыеСчета);
	Запрос.УстановитьПараметр("МоментВремени"		, КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("мЗначенияБывшСобственники"		, мЗначенияБывшСобственники);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();

	Если ВариантОтчета = 0 Тогда
		Макет = ЭтотОбъект.ПолучитьМакет("Форма10_ДляКартотеки");
		ТабДок.РазмерСтраницы = "A5";
		ТабДок.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВверх;
		ТабДок.АвтоМасштаб  = Истина;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Иначе
		Макет = ЭтотОбъект.ПолучитьМакет("Форма10_НаРуки");
		ТабДок.РазмерСтраницы = "A4";
		ТабДок.АвтоМасштаб  = Истина;
	КонецЕсли;
	//-bit_semenov.v_13.04.22
	
	ЗаголовокОбласть = Макет.ПолучитьОбласть("Заголовок");
	
	ВыборкаШапка = МассивРезультатов[8].Выбрать();
	ВыборкаШапка.Следующий();
	// БИТ_ЖКХ изменения кода . Начало: 07.02.2012
	// Замена алгоритма получения адреса проживания.
	
	НаборЗаписей = НЕОПРЕДЕЛЕНО;
	бит_УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(НаборЗаписей, ВыборкаШапка.ДомРег);
	ИскомаяСтрока = Неопределено;
	
	Для каждого СтрокаНабор Из НаборЗаписей  Цикл
		Если СтрокаНабор.Тип 	= Перечисления.бит_ТипыКонтактнойИнформации.Адрес
			И СтрокаНабор.Вид 	= Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания
			Тогда 
			ИскомаяСтрока = СтрокаНабор;
		КонецЕсли;	
	КонецЦикла;
	
	ЗаписьАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьПолныйАдрес(ИскомаяСтрока);
	
	Если ЗначениеЗаполнено(ЗаписьАдрес) Тогда
		
		//БИТ_ЖКХ 15.10.2018		
		СтруктураАдресРегистрации = ПолучитьАдресБСП(ИскомаяСтрока.Объект);
		//		СтруктураАдресРегистрации = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЗаписьАдрес);
		//---  
		
		Если СтруктураАдресРегистрации.Свойство("Регион") Тогда
			
			ЗаголовокОбласть.Параметры.РегионРег = СтруктураАдресРегистрации.Регион;
			
		КонецЕсли;
		
		Если СтруктураАдресРегистрации.Свойство("Район") Тогда
			
			ЗаголовокОбласть.Параметры.РайонРег = СтруктураАдресРегистрации.Район;
			
		КонецЕсли;
		Если СтруктураАдресРегистрации.Свойство("Город") Тогда
			
			ЗаголовокОбласть.Параметры.НаселенныйПунктРег 	= СтруктураАдресРегистрации.Город;
			
		ИначеЕсли СтруктураАдресРегистрации.Свойство("НаселенныйПункт") Тогда
			
			ЗаголовокОбласть.Параметры.НаселенныйПунктРег 	= СтруктураАдресРегистрации.НаселенныйПункт;
			
		КонецЕсли; 
		
	КонецЕсли;
	                               
	ОтветственноеЛицо = ВыборкаШапка.ВладелецЛС;
	Если ВариантОтчета = 0 Тогда
	   ЗаголовокОбласть.Параметры.Телефон            = бит_ОбщегоНазначения.ПолучитьТелефонИзКонтактнойИнформацииФизЛица(ВыборкаШапка.ВладелецЛС);
	КонецЕсли;
	
	ЗаголовокОбласть.Параметры.Заполнить(ВыборкаШапка);
	
	ЗаголовокОбласть.Параметры.КорпусРег = ПолучитьНомерКорпуса(ВыборкаШапка.Дом);
	ЗаголовокОбласть.Параметры.ДомРег = ПолучитьНомерДома(ВыборкаШапка.Дом);
	
	Если НЕ ЗначениеЗаполнено(ЗаголовокОбласть.Параметры.ФизЛицо) Тогда
		ЗаголовокОбласть.Параметры.ФизЛицо = ВыборкаШапка.ВладелецЛС;
	КонецЕсли; 
	
	//+bit_semenov.v_13.04.22
	Если ВариантОтчета = 0 И ПравоустанавливающиеДокументы Тогда  //Для картотеки и стоит галка на форме
		
	    ВыборкаДокументы = МассивРезультатов[9].Выбрать();
		
		ОснованияЗаселения = "";
		
		Пока ВыборкаДокументы.Следующий() Цикл
			Документ = СтрШаблон("%1 № %2 от %3 %4, ", ВыборкаДокументы.ВидДокумента , ВыборкаДокументы.НомерДокумента , Формат(ВыборкаДокументы.ДатаДокумента,"ДФ=dd.MM.yy") , ВыборкаДокументы.ОрганизацияВыдавшаяДокумент);
		    ОснованияЗаселения = ОснованияЗаселения + Документ;
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ОснованияЗаселения, 2);
		ЗаголовокОбласть.Параметры.ОснованияЗаселения = ОснованияЗаселения;
		
	КонецЕсли;
	
	ТЗ_Проживающие = МассивРезультатов[10].Выгрузить();
	
	//Наниматель(владелец)
	//ТЗ_Наниматели = ТЗ_Проживающие.Скопировать();
	//МассивСтрокДляУдаленияНаниматели = Новый Массив;

	//Для каждого стрТЗ из ТЗ_Наниматели Цикл 
	//	Если НЕ ЗначениеЗаполнено(стрТЗ.ДатаРегистрации)
	//		ИЛИ (ЗначениеЗаполнено(стрТЗ.ДатаСнятияРУ) И стрТЗ.ДатаСнятияРУ < ТекущаяДата()) Тогда
	//		МассивСтрокДляУдаленияНаниматели.Добавить(стрТЗ);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Для каждого стр Из МассивСтрокДляУдаленияНаниматели Цикл
	//	ТЗ_Наниматели.Удалить(стр);
	//КонецЦикла;   
	//
	//ТЗ_Наниматели.Свернуть("ФизЛицо, ДатаРождения, СтатусФизЛица, РодственнаяСвязь, СтатусПроживания, ДатаРегистрации, ДатаСнятияРУ, ФИО, ДоляПлощади, ДоляПлощадиСтрокой");
	
	//Удаление проживающих если стоит галка Проживающие только на данный момент
	МассивСтрокДляУдаления = Новый Массив;
	
	Для каждого стрТЗ из ТЗ_Проживающие Цикл 
		Если (СписокПроживающих И НЕ ЗначениеЗаполнено(стрТЗ.ДатаРегистрации))
			ИЛИ (СписокПроживающих И ЗначениеЗаполнено(стрТЗ.ДатаСнятияРУ) И стрТЗ.ДатаСнятияРУ < КонецДня(ТекущаяДата())) Тогда
			
			Если НЕ стрТЗ.Приоритет = 0 Тогда //Собс-к или наниматель выводятся всегда
			   МассивСтрокДляУдаления.Добавить(стрТЗ);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Для каждого стр Из МассивСтрокДляУдаления Цикл
		ТЗ_Проживающие.Удалить(стр);
	КонецЦикла;   
	
	ТЗ_Проживающие.Свернуть("ФизЛицо, ДатаРождения, СтатусФизЛица, РодственнаяСвязь, СтатусПроживания, ДатаРегистрации, ДатаСнятияРУ, ФИО, ДоляПлощади, ДоляПлощадиСтрокой, Приоритет, ЭтоОтвественный");
	
	//Сворачивание повторяющихся проживающих. Только если выбрано несколько ЛС
	Если ЛицевыеСчета.Количество() > 1 Тогда
		
		МассивСтрокДляУдаления = Новый Массив;
		
		ТЗ_УникальныеПроживающие = ТЗ_Проживающие.Скопировать();
	    ТЗ_УникальныеПроживающие.Свернуть("ФизЛицо, ДатаРождения, ДатаРегистрации, ФИО");
		
		Отбор = Новый Структура("ФизЛицо, ДатаРегистрации");
		Для каждого стрТЗ Из ТЗ_УникальныеПроживающие Цикл
			
			Отбор.ФизЛицо = стрТЗ.ФизЛицо;
			Отбор.ДатаРегистрации = стрТЗ.ДатаРегистрации;

			мПроживающий = ТЗ_Проживающие.НайтиСтроки(Отбор);
			
			ВсегоСтрок = мПроживающий.Количество();
			СтрокКУдаление = ВсегоСтрок - 1;
			
			Если ВсегоСтрок > 1 Тогда
				
				ЭтоСобственник = Ложь;
				
				Для каждого СтрМ Из мПроживающий Цикл
					
					Если СтрМ.Приоритет = 0 Тогда  //Собс-к или наниматель
						 ЭтоСобственник = Истина;
					КонецЕсли;		
					
				КонецЦикла;
				 
				Для каждого СтрМ Из мПроживающий Цикл
					
					Если НЕ СтрМ.Приоритет = 0 Тогда
						
					    Если ЭтоСобственник Тогда
						    МассивСтрокДляУдаления.Добавить(СтрМ);
						ИначеЕсли НЕ ЭтоСобственник И НЕ СтрокКУдаление = 0 Тогда
						    МассивСтрокДляУдаления.Добавить(СтрМ);
						ИначеЕсли НЕ ЭтоСобственник И СтрокКУдаление = 0 Тогда
							СтрМ.РодственнаяСвязь = "";
						КонецЕсли;
					
					КонецЕсли;
					
					СтрокКУдаление = СтрокКУдаление - 1;
					
				КонецЦикла; 
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого стр Из МассивСтрокДляУдаления Цикл
			ТЗ_Проживающие.Удалить(стр);
		КонецЦикла;
		
		ТЗ_Проживающие.Сортировать("ЭтоОтвественный УБЫВ, Приоритет, ДатаРегистрации");
	КонецЕсли;
	
	//Если ВариантОтчета = 0 Тогда  //Для картотеки 
		ФизЛицо = "";
		Для каждого стрТЗ из ТЗ_Проживающие Цикл 
			Доля = СокрЛП(стрТЗ.ДоляПлощадиСтрокой);
			Если НЕ Доля = "" 
				ИЛИ (стрТЗ.РодственнаяСвязь = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо И  Доля = "") Тогда
				ФизЛицо = ФизЛицо +  ФизическиеЛицаКлиентСервер.ФамилияИнициалы(стрТЗ.ФИО) + ", ";
			КонецЕсли;
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ФизЛицо, 2);
		ЗаголовокОбласть.Параметры.ФизЛицо = ФизЛицо;	
	//КонецЕсли;
		
	ТабДок.Вывести(ЗаголовокОбласть);
	
	СтрокаПроживающий = Макет.ПолучитьОбласть("СтрокаПроживающий");
	НомерСтроки = 1;
	
	Для каждого стрТЗ Из ТЗ_Проживающие Цикл
		ЗаполнениеТЧ(стрТЗ, Макет, ТабДок, ОтветственноеЛицо, НомерСтроки, СтрокаПроживающий);
	КонецЦикла;
	
	//вывод пустых строк
	МассивПустыхОбластей = Новый Массив;
	
	ОбластьПустая = Макет.ПолучитьОбласть("СтрокаПроживающий");
	
	МассивПустыхОбластей.Добавить(ОбластьПустая);
	
	Если ВариантОтчета = 1 Тогда //На руки
		ПодвалОбласть = Макет.ПолучитьОбласть("Подвал");
		МассивПустыхОбластей.Добавить(ПодвалОбласть);
	КонецЕсли;
	
	Пока ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок,  МассивПустыхОбластей) Цикл
	    ТабДок.Вывести(ОбластьПустая);
	КонецЦикла;
	
	Если НЕ ВтораяСтраница И ВариантОтчета = 0 Тогда
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		ЗаголовокОбласть2 = Макет.ПолучитьОбласть("Заголовок2");
		ТабДок.Вывести(ЗаголовокОбласть2);
		
		Пока ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок,  МассивПустыхОбластей) Цикл
			ТабДок.Вывести(ОбластьПустая);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВариантОтчета = 0 Тогда    //Для картотеки. Печатаем А5 на А4 
		ТабДок.РазмерСтраницы = "A4";
		ТабДок.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
		ТабДок.АвтоМасштаб  = Истина;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Иначе   //На руки
		
		ФИО = Пользователи.ТекущийПользователь().ФизическоеЛицо.ФИО;
		
		Если ФизическиеЛицаКлиентСервер.ФИОНаписаноВерно(ФИО) И ЗначениеЗаполнено(ФИО) Тогда
		   ПодвалОбласть.Параметры.Паспортист = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИО);
		Иначе
		   ПодвалОбласть.Параметры.Паспортист = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
		ТабДок.Вывести(ПодвалОбласть);
	КонецЕсли;
	//-bit_semenov.v_13.04.22
	
КонецПроцедуры

// Процедура заполнения табличной части макета.
Процедура ЗаполнениеТЧ(стрТЗ, Макет, ТабДок,ОтветственноеЛицо, НомерСтроки,СтрокаПроживающий)
	
	СтрокаПроживающий.Параметры.Номер = НомерСтроки;
	СтрокаПроживающий.Параметры.Заполнить(стрТЗ);
	
	//+bit_semenov.v_13.04.22
	Доля = СокрЛП(стрТЗ.ДоляПлощадиСтрокой);
	
	Если Доля = "1" ИЛИ Лев(Доля, 1) = "о" Тогда
		СтрокаПроживающий.Параметры.Доля = "";
	ИначеЕсли Лев(Доля, 1) = "с" Тогда
		СтрокаПроживающий.Параметры.Доля = "ОСС";
	Иначе
		СтрокаПроживающий.Параметры.Доля = Доля;
	КонецЕсли;
	
	Если НЕ Доля = "" Тогда
		СтрокаПроживающий.Параметры.РодственнаяСвязь = "Собст-к";
	ИначеЕсли стрТЗ.РодственнаяСвязь = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо И  Доля = "" Тогда
		СтрокаПроживающий.Параметры.РодственнаяСвязь = "Наниматель";
	ИначеЕсли Доля = "" Тогда
		СтрокаПроживающий.Параметры.РодственнаяСвязь = стрТЗ.РодственнаяСвязь;
	КонецЕсли;
	//-bit_semenov.v_13.04.22
	
	//Если стрТЗ.РодственнаяСвязь = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо и НЕ (стрТЗ.ФизЛицо = ОтветственноеЛицо) Тогда
	//	СтрокаПроживающий.Параметры.РодственнаяСвязь = "";
	//КонецЕсли; 
	
	НомерСтроки = НомерСтроки + 1;
	
	Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок,  СтрокаПроживающий) Тогда
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();	
		ЗаголовокОбласть2 = Макет.ПолучитьОбласть("Заголовок2");
		ТабДок.Вывести(ЗаголовокОбласть2);
		ТабДок.Вывести(СтрокаПроживающий);
		ВтораяСтраница = Истина;
	Иначе
		ТабДок.Вывести(СтрокаПроживающий);
	КонецЕсли;
	
КонецПроцедуры

//БИТ_ЖКХ 15.10.2018	
Функция ПолучитьАдресБСП(объектЛицевойСчет = неопределено)
	
	если ТипЗнч(объектЛицевойСчет) = Тип("СправочникСсылка.бит_ЛицевыеСчета") тогда 	
		если объектЛицевойСчет.Здание.КонтактнаяИнформация.Количество() > 0 тогда 	
			АдресРезультат = РаботаСАдресами.СведенияОбАдресе(объектЛицевойСчет.Здание.КонтактнаяИнформация[0].Значение); 					
		конецесли; 
	конецесли; 
	
	если ТипЗнч(объектЛицевойСчет) = Тип("Строка") тогда 
		АдресРезультат = РаботаСАдресами.СведенияОбАдресе(объектЛицевойСчет);
	конецесли; 
	
	если ТипЗнч(объектЛицевойСчет) = Тип("СправочникСсылка.бит_СписокЗданий") тогда 
		АдресРезультат = РаботаСАдресами.СведенияОбАдресе(объектЛицевойСчет.КонтактнаяИнформация[0].Значение);
	конецесли;	 
	
	
	СтруктураАдресРегистрации = Новый Структура;	
	СтруктураАдресРегистрации.Вставить("Страна", СокрЛП(АдресРезультат.Страна));
	СтруктураАдресРегистрации.Вставить("Представление", АдресРезультат.Представление);	
	СтруктураАдресРегистрации.Вставить("Регион", СокрЛП(АдресРезультат.Регион));
	СтруктураАдресРегистрации.Вставить("Район", СокрЛП(АдресРезультат.Район+ " " + строка(АдресРезультат.РайонСокращение)));   
	СтруктураАдресРегистрации.Вставить("Город", СокрЛП(АдресРезультат.Город + " " + строка(АдресРезультат.ГородСокращение)));
	СтруктураАдресРегистрации.Вставить("НаселенныйПункт", СокрЛП(строка(АдресРезультат.НаселенныйПункт) + " " + строка(АдресРезультат.НаселенныйПунктСокращение)));
	СтруктураАдресРегистрации.Вставить("Улица", СокрЛП(АдресРезультат.Улица + " " + строка(АдресРезультат.УлицаСокращение)));
	СтруктураАдресРегистрации.Вставить("Дом", СокрЛП(АдресРезультат.Здание.Номер));	
	//СтруктураАдресРегистрации.Вставить("корпус", ?(ЗначениеЗаполнено(АдресРезультат.Корпуса), СокрЛП(АдресРезультат.Корпуса[0].Номер),""));  
	СтруктураАдресРегистрации.Вставить("корпус", ПолучитьНомерКорпуса(АдресРезультат.Здание));
	СтруктураАдресРегистрации.Вставить("Квартира", ?(ЗначениеЗаполнено(АдресРезультат.Помещения), СокрЛП(АдресРезультат.Помещения[0].Номер),"")); 
	
	если объектЛицевойСчет <> неопределено и ТипЗнч(объектЛицевойСчет) = Тип("СправочникСсылка.бит_ЛицевыеСчета") тогда
		
		если СокрЛП(СтруктураАдресРегистрации.корпус) = "" и ЗначениеЗаполнено(объектЛицевойСчет.Здание) тогда
			СтруктураАдресРегистрации.корпус = объектЛицевойСчет.Здание.Корпус;
		конецесли; 	
		если СокрЛП(СтруктураАдресРегистрации.Улица) = "" тогда
			СтруктураАдресРегистрации.Улица = СокрЛП(объектЛицевойСчет.УлицаЛицевогоСчета);
		конецесли;	
		если СокрЛП(СтруктураАдресРегистрации.Дом) = "" и ЗначениеЗаполнено(объектЛицевойСчет.Здание) тогда
			СтруктураАдресРегистрации.Дом = объектЛицевойСчет.Здание.Наименование;
		конецесли;	
		если СокрЛП(СтруктураАдресРегистрации.Дом) = "" и ЗначениеЗаполнено(объектЛицевойСчет.Здание) тогда
			СтруктураАдресРегистрации.Квартира = объектЛицевойСчет.Квартира.Наименование;
		конецесли;	
		
	конецесли;	  
	
	возврат СтруктураАдресРегистрации; 
	
КонецФункции // ПолучитьАдресБСП()

Функция ПолучитьНомерКорпуса(Строка)
	
	ИсхДанные     = СокрЛП(Строка);
	
	ВхождениеКорпуса = СтрНайти(ВРЕГ(ИсхДанные), "КОРП.");
	
	Если ВхождениеКорпуса = 0 Тогда 
		ВхождениеКорпуса = СтрНайти(ВРЕГ(ИсхДанные), "К.");
	КонецЕсли;
	
	
	Если ВхождениеКорпуса > 0 Тогда
		КоличествоСимволов = (СтрДлина(ИсхДанные) - ВхождениеКорпуса - 4);
		Корпус = Прав(ИсхДанные, КоличествоСимволов);
		Возврат Корпус;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьНомерДома(Строка)
	
	ИсхДанные     = СокрЛП(Строка);
	
	ВхождениеДома = СтрНайти(ВРЕГ(ИсхДанные), "Д." );
	
	Если ВхождениеДома > 0 Тогда
		
		КоличествоСимволов = (СтрДлина(ИсхДанные) - ВхождениеДома - 1);
		Дом = Прав(ИсхДанные, КоличествоСимволов);
		
		ВхождениеКорпуса = СтрНайти(ВРЕГ(Дом), "КОРП.");
		
		Если ВхождениеКорпуса > 0 Тогда
			
			ДомБезКорпуса = Лев(Дом, ВхождениеКорпуса - 1);
			Возврат ДомБезКорпуса; 
			
		КонецЕсли;
		
		
		Возврат Дом;
		
	КонецЕсли;
	
	Возврат "";
КонецФункции	


#КонецОбласти

#КонецЕсли
